

##
## DEVICE  "EP2C35F672C7"
##


#**************************************************************
# Time Information
#**************************************************************


#**************************************************************
# Create Clock
#**************************************************************

create_clock -name {CLOCK_50} -period 20.000 [get_ports {CLOCK_50}]

#**************************************************************
# Create Generated Clock
#**************************************************************

#derive_pll_clocks -create_base_clocks

#**************************************************************
# Set Clock Latency
#**************************************************************



#**************************************************************
# Set Clock Uncertainty
#**************************************************************

derive_clock_uncertainty


#**************************************************************
# Set Clock Groups
#**************************************************************


#**************************************************************
# Set False Path
#**************************************************************


#**************************************************************
# Set Multicycle Path
#**************************************************************



#**************************************************************
# Set Maximum Delay
#**************************************************************



#**************************************************************
# Set Minimum Delay
#**************************************************************



#**************************************************************
# Set Input Transition
#**************************************************************



#**************************************************************
# Set Input Delay
#**************************************************************

set_input_delay -clock CLOCK_50 3 [get_ports SDRAM_DQ[*]]

#**************************************************************
# Set Output Delay
#**************************************************************

set_output_delay -clock CLOCK_50 5 [get_ports SDRAM_CKE]
set_output_delay -clock CLOCK_50 5 [get_ports SDRAM_CS_N]
set_output_delay -clock CLOCK_50 5 [get_ports SDRAM_RAS_N]
set_output_delay -clock CLOCK_50 5 [get_ports SDRAM_CAS_N]
set_output_delay -clock CLOCK_50 5 [get_ports SDRAM_WE_N]
set_output_delay -clock CLOCK_50 5 [get_ports SDRAM_ADDR[*]]
set_output_delay -clock CLOCK_50 5 [get_ports SDRAM_BA_0]
set_output_delay -clock CLOCK_50 5 [get_ports SDRAM_BA_1]
set_output_delay -clock CLOCK_50 5 [get_ports SDRAM_UDQM]
set_output_delay -clock CLOCK_50 5 [get_ports SDRAM_LDQM]
set_output_delay -clock CLOCK_50 5 [get_ports SDRAM_DQ[*]]

